export const techChoice = {
    title: '기술 선택 배경',
    description: '엘리스 부트캠프 수료 직후 시작한 프로젝트로 학습한 기술을 실제 서비스에 적용하며 숙련하는 것을 우선했습니다.',
    points: [
        'React, TypeScript, Recoil, Express, MongoDB 등은 부트캠프에서 학습한 스택을 실제 프로젝트에 적용하기 위해 선택했습니다.',
        "서버에서 일지 기록 등의 데이터는 TanStack Query로 관리하고 여러 컴포넌트에서 반복되는 상태 및 비즈니스 로직은 Custom Hook으로 분리해 데이터 처리와 UI 표현의 책임을 구분했습니다.",
        '트레이너와 회원 간 1:1 실시간 채팅에서 이벤트와 Room 단위 연결 관리가 필요해 이를 직접 구현해야 하는 기본 WebSocket보다 채팅방 관리와 재연결 처리를 간단하게 구현할 수 있는 Socket.IO를 선택했습니다.',
        '트레이너와 회원이 모바일에서 반복적으로 사용하는 서비스 특성을 고려해 앱과 유사한 사용 경험을 제공하기 위해 PWA를 적용했습니다.',
    ],
}